nxp-mcuxpresso/mcuxsdk-examples/_boards/lpcxpresso54s018/lvgl_examples/pin_mux.h
/*! @name PIO0_21 (coord C13), U28[J7]/P0_21-EMC_A3
  @{ */
#define BOARD_INITPINS_EMC_A3_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A3_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A3_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_4 (coord D4), U28[C2]/RP4[1]/P1_4-EMC_D11
  @{ */
#define BOARD_INITPINS_EMC_D11_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D11_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D11_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_5 (coord E4), U28[J3]/P1_5-EMC_A4
  @{ */
#define BOARD_INITPINS_EMC_A4_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A4_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A4_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_6 (coord G4), U28[J2]/P1_6-EMC_A5
  @{ */
#define BOARD_INITPINS_EMC_A5_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A5_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A5_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_7 (coord N1), U28[H3]/P1_7-EMC_A6
  @{ */
#define BOARD_INITPINS_EMC_A6_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A6_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A6_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_8 (coord P8), U28[H2]/P1_8-EMC_A7
  @{ */
#define BOARD_INITPINS_EMC_A7_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A7_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A7_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_9 (coord K6), U28[F7]/P1_9-EMC_CASn
  @{ */
#define BOARD_INITPINS_EMC_CASn_PORT 1U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_CASn_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_CASn_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_19 (coord L1), U28[E1]/RP4[4]/P1_19-EMC_D8
  @{ */
#define BOARD_INITPINS_EMC_D8_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D8_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D8_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_20 (coord M1), U28[D2]/RP4[3]/P1_20-EMC_D9
  @{ */
#define BOARD_INITPINS_EMC_D9_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D9_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D9_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_21 (coord N8), U28[D1]/RP4[2]/P1_21-EMC_D10
  @{ */
#define BOARD_INITPINS_EMC_D10_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_D10_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_D10_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_10 (coord N9), U28[F8]/P1_10-EMC_RASn
  @{ */
#define BOARD_INITPINS_EMC_RASn_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_RASn_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_RASn_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_11 (coord B4), U28[F2]/P1_11-EMC_CLK0
  @{ */
#define BOARD_INITPINS_EMC_CLK0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_CLK0_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_CLK0_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_12 (coord K9), U28[G9]/P1_12-EMC_DYCSn0
  @{ */
#define BOARD_INITPINS_EMC_DYCSn0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_DYCSn0_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_DYCSn0_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PIO1_13 (coord G10), U28[E8]/P1_13-EMC_DQM0
  @{ */
#define BOARD_INITPINS_EMC_DQM0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_DQM0_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_DQM0_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_14 (coord C12), U28[F1]/P1_14-EMC_DQM1
  @{ */
#define BOARD_INITPINS_EMC_DQM1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_DQM1_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_DQM1_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_15 (coord A11), U28[F3]/P1_15-EMC_CKE0
  @{ */
#define BOARD_INITPINS_EMC_CKE0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_CKE0_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_CKE0_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_16 (coord B7), U28[H9]/P1_16-EMC_A10
  @{ */
#define BOARD_INITPINS_EMC_A10_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_EMC_A10_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_EMC_A10_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                         /* @} */

